TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/flash_mode0_512_program/flash_mode0_512_program.c
//#############################################################################
//
//
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//#############################################################################

//
// Included Files
//
#include "board.h"
#include "driverlib.h"
#include "device.h"

//
// Include Flash API include file
//
#include "FlashTech_F29H85x_C29x.h"

//
// Include Flash API example header file
//
#include "flash_programming_F29H85x_C29.h"

//
// Defines
//

//
// Length (in bytes) of data buffer used for program
//
#define  WORDS_IN_FLASH_BUFFER    0x200

//
// Globals
//

//
// Data Buffers used for program operation using the flash API program function
//
uint8_t   Buffer[WORDS_IN_FLASH_BUFFER];
uint32_t   *Buffer32 = (uint32_t *)Buffer;

Fapi_FlashBankType  BankType = C29Bank;
Fapi_FOTAStatus  FOTAStatus = FOTA_Image;
uint32_t u32UserFlashConfig = 0;

//
// Prototypes
//

//
// Termination States
//
void Example_Error(Fapi_StatusType status);
void Example_Done(void);
void FMSTAT_Fail(void);
void ECC_Fail(void);

//
// Example Functions
//
void Example_CallFlashAPI(void);
void Example_EraseBanks(void);
void Example_EraseSector(void);
void Example_ProgramUsingC29AutoECC512bit(void);
void Example_ProgramUsingC29DataAndECC512bit(void);
void Example_ProgramUsingC29DataOnlyECCOnly512bit(void);
void Example_ProgramDataFlashUsingC29AutoECC512Bit(void);
void ClearFSMStatus(uint32_t u32StartAddress, uint32_t u32UserFlashConfig);
void ConstructInterleavedData1024Bits(uint8_t* sequential1024BitsArrPtr);

//
// Main
//
int main(void)
{

    //
    // Initialize device clock, peripheral clocks and interrupts
    //
    Device_init();
    Flash_initModule(3);

    //
    // Initialize SysConfig Settings
    //
    Board_init();

    //
    // Enable PIPE Global Interrupt (for INTs and RTINTs) and INT enable in CPU.
    //
    ENINT;
    Interrupt_enableGlobal();

    Fapi_StatusType  oReturnCheck;
    
    //
    // Request semaphore for CPU1
    //
    HWREG(SSUGEN_BASE + SSU_O_FLSEMREQ ) =  1;
    while ((HWREG( SSUGEN_BASE + SSU_O_FLSEMSTAT) & SSU_FLSEMSTAT_CPU_M)!= (0x1<<SSU_FLSEMSTAT_CPU_S));

    //
    // Set configuration as per user request
    //
    u32UserFlashConfig = Fapi_getUserConfiguration(BankType, FOTAStatus);

    Fapi_SetFlashCPUConfiguration(u32UserFlashConfig);

    //
    // Initialize the Flash API by providing the Flash register base address
    // and operating frequency(in MHz).
    // This function is required to initialize the Flash API based on System
    // frequency before any other Flash API operation can be performed.
    // This function must also be called whenever System frequency or RWAIT is
    // changed.
    //
    oReturnCheck = Fapi_initializeAPI((Fapi_FmcRegistersType*) FLASHCONTROLLER1_BASE, 200);

    if(oReturnCheck != Fapi_Status_Success)
    {
        //
        // Check Flash API documentation for possible errors
        //
        Example_Error(oReturnCheck);
    }
    
    //
    // Flash API functions should not be executed from the same bank on which
    // erase/program operations are in progress.
    // Also, note that there should not be any access to the Flash bank on
    // which erase/program operations are in progress.  Hence below function
    // is mapped to RAM for execution.
    //
    Example_CallFlashAPI();

    //
    // Example is done here
    //
    Example_Done();
}

//*****************************************************************************
//  ConstructInterleavedData1024Bits
//
//  Example function to reformat a 1024-bit data buffer so that it reads back correctly
//  when written to flash
//*****************************************************************************
void ConstructInterleavedData1024Bits(uint8_t* sequential1024BitsArrPtr)
{
    uint8_t* srcBuffer = sequential1024BitsArrPtr;
    uint8_t tmpBuffer[64];

    //
    // Even(first) interleaved region: 0-15, 32-47, 64-79, 96-111 Byte
    // Note: First even region (0-15) doesn't need to be re-copied, starting from 32 
    //
    int evenIdx = 32;  
    // Odd(second) interleaved region: 16-31, 48-63, 80-95, 112-127 Byte
    int oddIdx = 16; 
    
    //
    // Preparing temp buffer to store the 2nd half of 1024bit data composed of odd(second) interleaved 512bit data
    //
    for (int idx = 0; idx < 64; idx += 16)
    {
       memcpy(&tmpBuffer[idx], &srcBuffer[oddIdx], 16);
       oddIdx += 32;
    }

    //
    // Preparing src buffer to store the 1st half of 1024bit data composed of even(first) interleaved 512bit data
    // Skipping first even region (0-15)
    //
    for (int idx = 16; idx < 64; idx += 16)
    {
       memcpy(&srcBuffer[idx], &srcBuffer[evenIdx], 16);
       evenIdx += 32;
    }

    //
    // Copying the 2nd half of 1024bit back to the bottom half of the original buffer
    //
    memcpy(&srcBuffer[64], tmpBuffer, 64);
}

//**************************************************************************************
//  ClearFSMStatus
//
//  This function clears the status (STATCMD, similar to FMSTAT of the previous
//  devices) of the previous flash operation.
//  This function and the flash API functions used in this function are
//  executed from RAM in this example.
//**************************************************************************************

