TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/flash_mode0_512_program/flash_mode0_512_program.c
void ClearFSMStatus(uint32_t u32StartAddress, uint32_t u32UserFlashConfig){
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_StatusType  oReturnCheck;

    //
    // Wait until FSM is done with the previous flash operation
    //
    while (Fapi_checkFsmForReady(u32StartAddress, u32UserFlashConfig) != Fapi_Status_FsmReady){}
    oFlashStatus = Fapi_getFsmStatus(u32StartAddress, u32UserFlashConfig);

    //
    // Clear the Status register
    //
    oReturnCheck = Fapi_issueAsyncCommand(u32StartAddress, u32UserFlashConfig, Fapi_ClearStatus);
    
    //
    // Wait until status is cleared
    //
    while (Fapi_getFsmStatus(u32StartAddress, u32UserFlashConfig) != 0) {}

    if(oReturnCheck != Fapi_Status_Success)
    {
        //
        // Check Flash API documentation for possible errors
        //
        Example_Error(oReturnCheck);
    }
}

//*****************************************************************************
//  Example_CallFlashAPI
//
//  This function will interface to the flash API.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************
void Example_CallFlashAPI(void)
{
    uint32_t i = 0;

    //
    // Fill a buffer with data to program into the flash.
    //
    for(i=0; i < WORDS_IN_FLASH_BUFFER; i++)
    {
        Buffer[i] = i;
    }


    //
    // Reformat the buffer so that it is written to flash
    // in the same order
    //
    for (i = 0; i < 4; i++)
    {
        ConstructInterleavedData1024Bits(Buffer + (i*128));
    }

    //
    // Erase banks before programming
    //
    Example_EraseBanks();

    //
    // Program first 0x200 bytes of FR1RP1 (at 0x10100000) using 512-bit AutoECC option
    //
    Example_ProgramUsingC29AutoECC512bit();

    //
    // Erase the sector
    //
    Example_EraseSector();

    //
    // Program first 0x200 bytes of FR1RP2 (at 0x10200000) using 512-bit DataAndECC option
    //
    Example_ProgramUsingC29DataAndECC512bit();

    //
    // Program first 0x200 bytes of FR1RP3 (at 0x10300000) using 512-bit DataOnly and EccOnly option
    //
    Example_ProgramUsingC29DataOnlyECCOnly512bit();

    //
    // Reset data buffer for non-interleaved banks
    //
    for (i = 0 ; i < WORDS_IN_FLASH_BUFFER; i++)
    {
        Buffer[i] = i;
    }
    
    //
    // Program first 0x200 bytes of FR4RP0 (at 0x10C00000) using 512-bit AutoECC option
    //
    Example_ProgramDataFlashUsingC29AutoECC512Bit();

    //
    // Erase all Mode 0 interleaved banks for clean exit
    //
    Example_EraseBanks();
}

//*****************************************************************************
//  Example_ProgramUsingC29AutoECC512bit
//
//  Example function to Program data in Flash using "AutoEccGeneration" option.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************
void Example_ProgramUsingC29AutoECC512bit(void)
{
    uint32_t u32Index = 0, u32CurrentAddress=0;
    uint32_t sector = 0;
    uint32_t i = 0, j= 0;
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType  oFlashStatusWord;
    uint8_t u8Iterator = 0;

    //
    // Issue program command for of Mode 0 Main array interleaved bank FR1RP0
    //
    for(u32CurrentAddress = C29FlashBankFR1RP1StartAddress; u32CurrentAddress < C29FlashBankFR1RP1EndAddressPlus1; u32CurrentAddress += FlashC29BankOffset)
    {

        //
        // Program 0x200 words to given bank
        //
        for(i=0, u32Index = u32CurrentAddress; (u32Index < (u32CurrentAddress + WORDS_IN_FLASH_BUFFER)); i+= 128, u32Index+= 128)
        {
            for(u8Iterator = 1; u8Iterator <= 2; u8Iterator++)
            {
                ClearFSMStatus(u32Index, u32UserFlashConfig);

                //
                // Enable program/erase protection for select sectors where this example is
                // located CMDWEPROTA, CMDWEPROTB
                //
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig,  FLASH_NOWRAPPER_O_CMDWEPROTA, 0x00000000);
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig,  FLASH_NOWRAPPER_O_CMDWEPROTB, 0x00000000);

                oReturnCheck = Fapi_issueAutoEcc512ProgrammingCommand((uint32_t *)u32Index,Buffer+i,
                                                                    64, u32UserFlashConfig, u8Iterator);

                //
                // Wait until the Flash program operation is over
                //
                while(Fapi_checkFsmForReady(u32Index,  u32UserFlashConfig) == Fapi_Status_FsmBusy);

                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }

                //
                // Read FMSTAT register contents to know the status of FSM after
                // program command to see if there are any program operation related
                // errors
                //
                oFlashStatus = Fapi_getFsmStatus(u32Index,  u32UserFlashConfig);
                if(oFlashStatus != 3)
                {
                    //
                    // Check FMSTAT and debug accordingly
                    //
                    FMSTAT_Fail();
                }

                //
                // Verify the programmed values.  Check for any ECC errors.
                //
                oReturnCheck = Fapi_doVerify((uint32_t *)u32Index,
                                            16, (uint32_t *)(uint32_t)(Buffer + i),
                                            &oFlashStatusWord, u8Iterator, u32UserFlashConfig);

                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }
            }
        }
    }
}

//*****************************************************************************
//  Example_ProgramUsingC29DataAndECC512bit
//
//  Example function to Program data in Flash using "DataAndEcc" option.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************

void Example_ProgramUsingC29DataAndECC512bit(void)
{
    uint32_t u32Index = 0, u32CurrentAddress=0;
    uint32_t sector = 0;
    uint32_t i = 0, j = 0;
    uint8_t u8Iterator = 0;
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType  oFlashStatusWord;
    uint32_t ECC_B = 0, ECC_LB = 0, ECC_HB = 0;
    uint8_t u8ECC_array[8] = {0};
    uint64_t *LData, *HData;
    uint32_t u32ECC_array[4] = {0};

    //
    // Issue program command for Mode 0 Main array interleaved bank FR1RP1
    //
    for(u32CurrentAddress = C29FlashBankFR1RP2StartAddress; u32CurrentAddress < C29FlashBankFR1RP2EndAddressPlus1; u32CurrentAddress += FlashC29BankOffset)
    {

        //
        // Program 0x200 words to given bank
        //
        for(i=0, u32Index = u32CurrentAddress; (u32Index < (u32CurrentAddress + WORDS_IN_FLASH_BUFFER)); i+= 128, u32Index+= 128)
        {
            for(u8Iterator = 1; u8Iterator <= 2; u8Iterator++)
            {
                ClearFSMStatus(u32Index, u32UserFlashConfig);

                //
                // Enable program/erase protection for select sectors where this example is
                // located CMDWEPROTA, CMDWEPROTB
                //
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTA, 0x00000000);
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTB, 0x00000000);

                for(j=0; j<8; j+=2)
                {
                    //
                    // Point LData to the lower 64 bit data
                    // and   HData to the higher 64 bit data
                    //
                    LData = (uint64_t *)(Buffer + i/4 + j*8);
                    HData = (uint64_t *)(Buffer + i/4 + j*8 + 8);

                    //
                    // Calculate ECC for lower 64 bit and higher 64 bit data
                    //
                    ECC_LB = u8ECC_array[j] =   Fapi_calculateEcc((uint32_t *)(u32Index + j*16),LData, u8Iterator);
                    ECC_HB = u8ECC_array[j+1] = Fapi_calculateEcc((uint32_t *)(u32Index+ j*16 + 8) ,HData, u8Iterator);
                    u32ECC_array[j/2] = (uint32_t) ((ECC_HB<<8) | ECC_LB);

