TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/flash_mode0_512_program/flash_mode0_512_program.c
                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }

                //
                // Read FMSTAT register contents to know the status of FSM after
                // program command to see if there are any program operation related
                // errors
                //
                oFlashStatus = Fapi_getFsmStatus(u32Index, u32UserFlashConfig);
                if(oFlashStatus != 3)
                {
                    //
                    // Check FMSTAT and debug accordingly
                    //
                    FMSTAT_Fail();
                }

                //
                // Verify the programmed values.  Check for any ECC errors.
                //
                oReturnCheck = Fapi_doVerify((uint32_t *)(u32Index),
                                            16, (uint32_t *)(uint32_t)(Buffer+i),
                                            &oFlashStatusWord, u8Iterator, u32UserFlashConfig);

                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }
            }
        }
    }
}

//*****************************************************************************
//  Example_ProgramDataFlashUsingC29AutoECC
//
//  Example function to Program data in Flash using "AutoEccGeneration" option.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************

void Example_ProgramDataFlashUsingC29AutoECC512Bit(void)
{
    uint32_t u32Index = 0, u32CurrentAddress=0;
    uint32_t sector = 0;
    uint32_t i = 0, j= 0;
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType  oFlashStatusWord;
    uint8_t u8Iterator = 0;

    //
    // Issue program command for of Mode 0 Main array data bank FR4RP0
    //
    for(u32CurrentAddress = C29FlashBankFR4RP0StartAddress; u32CurrentAddress < C29FlashBankFR4RP0EndAddressPlus1; u32CurrentAddress += FlashC29BankOffset)
    {

        //
        // Program 0x200 words to given bank
        //
        for(i=0, u32Index = u32CurrentAddress; (u32Index < (u32CurrentAddress + WORDS_IN_FLASH_BUFFER)); i+= 64, u32Index+= 64)
        {
                ClearFSMStatus(u32Index, u32UserFlashConfig);

                //
                // Enable program/erase protection for select sectors where this example is
                // located CMDWEPROTA, CMDWEPROTB
                //
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig,  FLASH_NOWRAPPER_O_CMDWEPROTA, 0x00000000);
                Fapi_setupBankSectorEnable((uint32_t *)u32Index, u32UserFlashConfig,  FLASH_NOWRAPPER_O_CMDWEPROTB, 0x00000000);

                oReturnCheck = Fapi_issueAutoEcc512ProgrammingCommand((uint32_t *)u32Index,Buffer+i,
                                                                    64, u32UserFlashConfig, 0);

                //
                // Wait until the Flash program operation is over
                //
                while(Fapi_checkFsmForReady(u32Index,  u32UserFlashConfig) == Fapi_Status_FsmBusy);

                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }

                //
                // Read FMSTAT register contents to know the status of FSM after
                // program command to see if there are any program operation related
                // errors
                //
                oFlashStatus = Fapi_getFsmStatus(u32Index,  u32UserFlashConfig);
                if(oFlashStatus != 3)
                {
                    //
                    // Check FMSTAT and debug accordingly
                    //
                    FMSTAT_Fail();
                }

                //
                // Verify the programmed values.  Check for any ECC errors.
                //
                oReturnCheck = Fapi_doVerifyByByte((uint32_t *)u32Index,
                                            64, (uint32_t *)(uint32_t)(Buffer + i),
                                            &oFlashStatusWord, 0, u32UserFlashConfig);

                if(oReturnCheck != Fapi_Status_Success)
                {
                    //
                    // Check Flash API documentation for possible errors
                    //
                    Example_Error(oReturnCheck);
                }
        }
    }
}

//*****************************************************************************
//  Example_EraseBanks
//
//  Example function to Erase data of a sector in Flash.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************
Fapi_FlashStatusType  oFlashStatus;
void Example_EraseBanks(void)
{
    Fapi_StatusType  oReturnCheck;

    Fapi_FlashStatusWordType  oFlashStatusWord;
    uint32_t u32CurrentAddress = 0;
    uint8_t  u8Iterator = 0;
    uint32_t delay = 0;

    //
    // Issue bank erase command
    //
    for(u32CurrentAddress = C29FlashBankFR1RP1StartAddress; u32CurrentAddress < C29FlashBankFR1RP3EndAddressPlus1; u32CurrentAddress += FlashC29BankOffset)
    {
        //
        // Loop for erasing 1 interleaved bank
        //
        for(u8Iterator = 1; u8Iterator <= 2; u8Iterator++)
        {
            oFlashStatus = 0;
            ClearFSMStatus(u32CurrentAddress, u32UserFlashConfig);

            //
            // Enable program/erase protection for select sectors where this example is
            // located  CMDWEPROTA, CMDWEPROTB
            //
            Fapi_setupBankSectorEnable((uint32_t *)(u32CurrentAddress), u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTA, 0x00000000);
            Fapi_setupBankSectorEnable((uint32_t *)(u32CurrentAddress), u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTB, 0x00000000);

            //
            // Issue bank erase command
            //
            oReturnCheck = Fapi_issueBankEraseCommand((uint32_t *)(u32CurrentAddress), u8Iterator , u32UserFlashConfig);

            //
            // Wait until FSM is done with erase operation
            //
            while (Fapi_checkFsmForReady(u32CurrentAddress, u32UserFlashConfig) != Fapi_Status_FsmReady){}

